Процедура ОбработкаПроведения(Отказ, Режим)
	Если Продукты.Количество() = 0 Тогда
		Сообщить("Родной, документ строк то не содержит");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Движения.Продукты.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДорогаПродукты.Продукт КАК Продукт,
		|	СУММА(ДорогаПродукты.Колличество) КАК Колличество,
		|	ДорогаПродукты.Цена КАК Цена,
		|	СУММА(ДорогаПродукты.Колличество * ДорогаПродукты.Цена) КАК Сумма
		|ИЗ
		|	Документ.Дорога.Продукты КАК ДорогаПродукты
		|ГДЕ
		|	ДорогаПродукты.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДорогаПродукты.Продукт,
		|	ДорогаПродукты.Цена";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.Продукты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Продукт = ВыборкаДетальныеЗаписи.Продукт;
		Движение.Количество = ВыборкаДетальныеЗаписи.Колличество;
	КонецЦикла;
КонецПроцедуры