Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Продукты.Количество() = 0 Тогда
		Сообщить("Родной, документ строк то не содержит");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Движения.Продукты.Записывать = Истина;
	Для Каждого Строка Из Продукты Цикл
		Движение = Движения.Продукты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Продукт = Строка.Продукт;
		Движение.Количество = Строка.Колличество;
		Движение.Сумма = Строка.Колличество * Строка.Цена;
	КонецЦикла;
КонецПроцедуры